In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
df = pd.read_excel("text_exercise.XLSX")
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      object
 5   age         8 non-null      object
dtypes: object(6)
memory usage: 512.0+ bytes

In [6]:
df.staff

0         Tom BLUE
1       JOHN BLACK
2    Micheal Brown
3     jason walker
4       Alex Green
5      OSCAR SMİTH
6      Adrian STAR
7     Albert simon
Name: staff, dtype: object

In [7]:
df.staff.str.lower()

0         tom blue
1       john black
2    micheal brown
3     jason walker
4       alex green
5     oscar smi̇th
6      adrian star
7     albert simon
Name: staff, dtype: object

In [8]:
df.staff.str.upper()

0         TOM BLUE
1       JOHN BLACK
2    MICHEAL BROWN
3     JASON WALKER
4       ALEX GREEN
5      OSCAR SMİTH
6      ADRIAN STAR
7     ALBERT SIMON
Name: staff, dtype: object

In [9]:
df.staff.str.title()

0         Tom Blue
1       John Black
2    Micheal Brown
3     Jason Walker
4       Alex Green
5     Oscar Smi̇th
6      Adrian Star
7     Albert Simon
Name: staff, dtype: object

In [11]:
df.staff.str.capitalize()

0         Tom blue
1       John black
2    Micheal brown
3     Jason walker
4       Alex green
5     Oscar smi̇th
6      Adrian star
7     Albert simon
Name: staff, dtype: object

In [12]:
df.staff.str.swapcase()

0         tOM blue
1       john black
2    mICHEAL bROWN
3     JASON WALKER
4       aLEX gREEN
5     oscar smi̇th
6      aDRIAN star
7     aLBERT SIMON
Name: staff, dtype: object

In [3]:
df["staff"] = df.staff.str.title()
df.staff

0         Tom Blue
1       John Black
2    Micheal Brown
3     Jason Walker
4       Alex Green
5     Oscar Smi̇th
6      Adrian Star
7     Albert Simon
Name: staff, dtype: object

In [4]:
df

      id          staff department                 job       salary age
0  M0001       Tom Blue         HR             manager   "$150,000"  52
1  M0002     John Black         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   Jason Walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004   Oscar Smi̇th         IT  frontend developer   "$120,000"  32
6  E0005    Adrian Star         IT      data scientist   "$135,000"  40
7  E0006   Albert Simon         IT      data scientist  125000dolar  35

In [16]:
df.job.str.isalpha()

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7    False
Name: job, dtype: bool

In [22]:
type(df.job[2])

str

In [5]:
df.age.str.isnumeric()
# df içindeki veriler

0      NaN
1      NaN
2      NaN
3      NaN
4    False
5      NaN
6      NaN
7      NaN
Name: age, dtype: object

In [25]:
df.age.dtypes

dtype('O')

In [6]:
type(df.age[0])

int

In [7]:
df.age.astype("str").str.isnumeric()

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
Name: age, dtype: bool

In [8]:
df.age = df.age.astype("str")

In [10]:
type(df.age[0])

str

In [12]:
df.age.replace("-", np.nan, inplace=True)

In [13]:
df

      id          staff department                 job       salary  age
0  M0001       Tom Blue         HR             manager   "$150,000"   52
1  M0002     John Black         IT             manager   "$180,000"   48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"   35
3  E0002   Jason Walker         HR           recruiter  130000dolar   38
4  E0003     Alex Green         IT   backend developer   "$110,000"  NaN
5  E0004   Oscar Smi̇th         IT  frontend developer   "$120,000"   32
6  E0005    Adrian Star         IT      data scientist   "$135,000"   40
7  E0006   Albert Simon         IT      data scientist  125000dolar   35

In [15]:
df.age = df.age.astype("float")

In [16]:
df

      id          staff department                 job       salary   age
0  M0001       Tom Blue         HR             manager   "$150,000"  52.0
1  M0002     John Black         IT             manager   "$180,000"  48.0
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35.0
3  E0002   Jason Walker         HR           recruiter  130000dolar  38.0
4  E0003     Alex Green         IT   backend developer   "$110,000"   NaN
5  E0004   Oscar Smi̇th         IT  frontend developer   "$120,000"  32.0
6  E0005    Adrian Star         IT      data scientist   "$135,000"  40.0
7  E0006   Albert Simon         IT      data scientist  125000dolar  35.0

In [17]:
df.salary

0     "$150,000"
1     "$180,000"
2     "$150,000"
3    130000dolar
4     "$110,000"
5     "$120,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

In [18]:
df.salary.str.isalnum()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

In [19]:
df.job

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

In [20]:
df.job.str.startswith("data")

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [21]:
df.loc[df.job.str.startswith("data")]

      id          staff department             job       salary   age
2  E0001  Micheal Brown         IT  data scientist   "$150,000"  35.0
6  E0005    Adrian Star         IT  data scientist   "$135,000"  40.0
7  E0006   Albert Simon         IT  data scientist  125000dolar  35.0

In [22]:
df.job.str.endswith("per")

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: job, dtype: bool

In [23]:

df.loc[df.job.str.endswith("per")]

      id         staff department                 job      salary   age
4  E0003    Alex Green         IT   backend developer  "$110,000"   NaN
5  E0004  Oscar Smi̇th         IT  frontend developer  "$120,000"  32.0

In [24]:
df.job

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

In [25]:
df.job.str.contains("end")

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: job, dtype: bool

In [26]:
df.loc[df.job.str.contains("end")]

      id         staff department                 job      salary   age
4  E0003    Alex Green         IT   backend developer  "$110,000"   NaN
5  E0004  Oscar Smi̇th         IT  frontend developer  "$120,000"  32.0

In [27]:
df.salary

0     "$150,000"
1     "$180,000"
2     "$150,000"
3    130000dolar
4     "$110,000"
5     "$120,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

In [28]:
df.salary.str.contains("[a-z]")

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

In [29]:
df.loc[df.salary.str.contains("[a-z]")]

      id         staff department             job       salary   age
3  E0002  Jason Walker         HR       recruiter  130000dolar  38.0
7  E0006  Albert Simon         IT  data scientist  125000dolar  35.0

In [30]:
df.loc[df.salary.str.contains("[a-z]+")]

      id         staff department             job       salary   age
3  E0002  Jason Walker         HR       recruiter  130000dolar  38.0
7  E0006  Albert Simon         IT  data scientist  125000dolar  35.0

In [31]:
df

      id          staff department                 job       salary   age
0  M0001       Tom Blue         HR             manager   "$150,000"  52.0
1  M0002     John Black         IT             manager   "$180,000"  48.0
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35.0
3  E0002   Jason Walker         HR           recruiter  130000dolar  38.0
4  E0003     Alex Green         IT   backend developer   "$110,000"   NaN
5  E0004   Oscar Smi̇th         IT  frontend developer   "$120,000"  32.0
6  E0005    Adrian Star         IT      data scientist   "$135,000"  40.0
7  E0006   Albert Simon         IT      data scientist  125000dolar  35.0

In [32]:
df.loc[df.job.str.startswith("data"), "department"]

2    IT
6    IT
7    IT
Name: department, dtype: object

In [33]:
df.loc[df.job.str.startswith("data"), "department"] = "DS"

In [34]:
df

      id          staff department                 job       salary   age
0  M0001       Tom Blue         HR             manager   "$150,000"  52.0
1  M0002     John Black         IT             manager   "$180,000"  48.0
2  E0001  Micheal Brown         DS      data scientist   "$150,000"  35.0
3  E0002   Jason Walker         HR           recruiter  130000dolar  38.0
4  E0003     Alex Green         IT   backend developer   "$110,000"   NaN
5  E0004   Oscar Smi̇th         IT  frontend developer   "$120,000"  32.0
6  E0005    Adrian Star         DS      data scientist   "$135,000"  40.0
7  E0006   Albert Simon         DS      data scientist  125000dolar  35.0

In [39]:
df.salary = df.salary.str.strip('$"dolar')
df.salary

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [52]:
df["salary"] = df.salary.str.replace(",", "")
df.salary

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: object

In [53]:

df["salary"] = df.salary.astype("int")

In [56]:
df.salary.mean()

137500.0

In [57]:
df

      id          staff department                 job  salary   age
0  M0001       Tom Blue         HR             manager  150000  52.0
1  M0002     John Black         IT             manager  180000  48.0
2  E0001  Micheal Brown         DS      data scientist  150000  35.0
3  E0002   Jason Walker         HR           recruiter  130000  38.0
4  E0003     Alex Green         IT   backend developer  110000   NaN
5  E0004   Oscar Smi̇th         IT  frontend developer  120000  32.0
6  E0005    Adrian Star         DS      data scientist  135000  40.0
7  E0006   Albert Simon         DS      data scientist  125000  35.0

In [58]:
df.staff.str.split()

0         [Tom, Blue]
1       [John, Black]
2    [Micheal, Brown]
3     [Jason, Walker]
4       [Alex, Green]
5     [Oscar, Smi̇th]
6      [Adrian, Star]
7     [Albert, Simon]
Name: staff, dtype: object

In [60]:
df.staff.str.split()[0]

['Tom', 'Blue']

In [61]:
df.staff.str.split().str[0]

0        Tom
1       John
2    Micheal
3      Jason
4       Alex
5      Oscar
6     Adrian
7     Albert
Name: staff, dtype: object

In [62]:
df.staff.str.split().str[1]

0      Blue
1     Black
2     Brown
3    Walker
4     Green
5    Smi̇th
6      Star
7     Simon
Name: staff, dtype: object

In [63]:
df["first_name"] = df.staff.str.split().str[0]
df.first_name

0        Tom
1       John
2    Micheal
3      Jason
4       Alex
5      Oscar
6     Adrian
7     Albert
Name: first_name, dtype: object

In [64]:
df["last_name"] = df.staff.str.split().str[1]
df.last_name

0      Blue
1     Black
2     Brown
3    Walker
4     Green
5    Smi̇th
6      Star
7     Simon
Name: last_name, dtype: object

In [65]:
df

,id,staff,department,job,salary,age,first_name,last_name
0,M0001,Tom Blue,HR,manager,150000,52.0,Tom,Blue
1,M0002,John Black,IT,manager,180000,48.0,John,Black
2,E0001,Micheal Brown,DS,data scientist,150000,35.0,Micheal,Brown
3,E0002,Jason Walker,HR,recruiter,130000,38.0,Jason,Walker
4,E0003,Alex Green,IT,backend developer,110000,NaN,Alex,Green
5,E0004,Oscar Smi̇th,IT,frontend developer,120000,32.0,Oscar,Smi̇th
6,E0005,Adrian Star,DS,data scientist,135000,40.0,Adrian,Star
7,E0006,Albert Simon,DS,data scientist,125000,35.0,Albert,Simon

In [66]:
del df["staff"]

In [67]:
df

      id department                 job  salary   age first_name last_name
0  M0001         HR             manager  150000  52.0        Tom      Blue
1  M0002         IT             manager  180000  48.0       John     Black
2  E0001         DS      data scientist  150000  35.0    Micheal     Brown
3  E0002         HR           recruiter  130000  38.0      Jason    Walker
4  E0003         IT   backend developer  110000   NaN       Alex     Green
5  E0004         IT  frontend developer  120000  32.0      Oscar    Smi̇th
6  E0005         DS      data scientist  135000  40.0     Adrian      Star
7  E0006         DS      data scientist  125000  35.0     Albert     Simon

In [77]:
df.columns

Index(['id', 'department', 'job', 'salary', 'age', 'first_name', 'last_name'], dtype='object')

In [80]:
df.job

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

In [81]:
df.job.str.find("developer")
#-1 dönen satırların içinde "developer" kelimesi yok
# 4 ve 5 indexli satırlarda var . 4.satırda 8. indexten itibaren ifade başlıuyr

0   -1
1   -1
2   -1
3   -1
4    8
5    9
6   -1
7   -1
Name: job, dtype: int64

In [86]:
df.job.str.find("t")

0   -1
1   -1
2    2
3    6
4   -1
5    4
6    2
7    2
Name: job, dtype: int64

In [84]:
df.job.str.rfind("t")
# ifadeyi son bulduğu index numarasını döndürür.

0    -1
1    -1
2    13
3     6
4    -1
5     4
6    13
7    13
Name: job, dtype: int64

In [83]:
help(str.rfind)

Help on method_descriptor:

rfind(...)
    S.rfind(sub[, start[, end]]) -> int

    Return the highest index in S where substring sub is found,
    such that sub is contained within S[start:end].  Optional
    arguments start and end are interpreted as in slice notation.

    Return -1 on failure.

In [87]:
df.job

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

In [88]:
df.job.str.findall("d")

0        []
1        []
2       [d]
3        []
4    [d, d]
5    [d, d]
6       [d]
7       [d]
Name: job, dtype: object

In [89]:
df.job.str.findall("data")

0        []
1        []
2    [data]
3        []
4        []
5        []
6    [data]
7    [data]
Name: job, dtype: object

In [92]:
df.job.str.findall("a").apply(len)
# a ifadesi hangi satırda kaç dfa geçmiş onu buldu.

0    2
1    2
2    2
3    0
4    1
5    0
6    2
7    2
Name: job, dtype: int64

In [94]:
df["skills"] = [[],["Java","C++"],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
df["Skills"] = [[],[],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000,52.0,Tom,Blue,[],[]
1,M0002,IT,manager,180000,48.0,John,Black,"[Java, C++]",[]
2,E0001,DS,data scientist,150000,35.0,Micheal,Brown,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,E0002,HR,recruiter,130000,38.0,Jason,Walker,[],[]
4,E0003,IT,backend developer,110000,NaN,Alex,Green,"[React, Django]","[React, Django]"
5,E0004,IT,frontend developer,120000,32.0,Oscar,Smi̇th,"[JavaScript, Python]","[JavaScript, Python]"
6,E0005,DS,data scientist,135000,40.0,Adrian,Star,"[R, SQL]","[R, SQL]"
7,E0006,DS,data scientist,125000,35.0,Albert,Simon,"[SQL, Python]","[SQL, Python]"

In [95]:
df.loc[1, "Skills"] = "Java, C++"
df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000,52.0,Tom,Blue,[],[]
1,M0002,IT,manager,180000,48.0,John,Black,"[Java, C++]","Java, C++"
2,E0001,DS,data scientist,150000,35.0,Micheal,Brown,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,E0002,HR,recruiter,130000,38.0,Jason,Walker,[],[]
4,E0003,IT,backend developer,110000,NaN,Alex,Green,"[React, Django]","[React, Django]"
5,E0004,IT,frontend developer,120000,32.0,Oscar,Smi̇th,"[JavaScript, Python]","[JavaScript, Python]"
6,E0005,DS,data scientist,135000,40.0,Adrian,Star,"[R, SQL]","[R, SQL]"
7,E0006,DS,data scientist,125000,35.0,Albert,Simon,"[SQL, Python]","[SQL, Python]"

In [97]:
type(df.skills[0])

list

In [98]:
df.skills.str.join(",")

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: skills, dtype: object

In [99]:
df.skills.str.join("-")

0
1              Java-C++
2    Python-Tableau-SQL
3
4          React-Django
5     JavaScript-Python
6                 R-SQL
7            SQL-Python
Name: skills, dtype: object

In [100]:
df.Skills

0                        []
1                 Java, C++
2    [Python, Tableau, SQL]
3                        []
4           [React, Django]
5      [JavaScript, Python]
6                  [R, SQL]
7             [SQL, Python]
Name: Skills, dtype: object

In [103]:
df.Skills.str.join(",")

0
1     J,a,v,a,,, ,C,+,+
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [ ]:
df.Skills.apply(lambda x :

In [118]:
names = ["Fırat, Serhat"]
new_names = ",".join(names)
print(type(new_names))

<class 'str'>

In [119]:
df.Skills

0                        []
1                 Java, C++
2    [Python, Tableau, SQL]
3                        []
4           [React, Django]
5      [JavaScript, Python]
6                  [R, SQL]
7             [SQL, Python]
Name: Skills, dtype: object

In [120]:
df.Skills.apply(lambda x : ",".join(x) if type(x) == list else x)

0
1             Java, C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [121]:
df.Skills.apply(lambda x : "-".join(x) if type(x) == list else x)

0
1             Java, C++
2    Python-Tableau-SQL
3
4          React-Django
5     JavaScript-Python
6                 R-SQL
7            SQL-Python
Name: Skills, dtype: object

In [122]:
[";".join(x) if type(x) == list else x for x in df.Skills]

['',
 'Java, C++',
 'Python;Tableau;SQL',
 '',
 'React;Django',
 'JavaScript;Python',
 'R;SQL',
 'SQL;Python']

In [123]:
df.Skills

0                        []
1                 Java, C++
2    [Python, Tableau, SQL]
3                        []
4           [React, Django]
5      [JavaScript, Python]
6                  [R, SQL]
7             [SQL, Python]
Name: Skills, dtype: object

In [125]:
df["Skills"] = df.Skills.apply(lambda x : ",".join(x) if type(x) == list else x)
df.Skills

0
1             Java, C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [126]:
df.department

0    HR
1    IT
2    DS
3    HR
4    IT
5    IT
6    DS
7    DS
Name: department, dtype: object

In [127]:
pd.get_dummies(df.department)

   DS  HR  IT
0   0   1   0
1   0   0   1
2   1   0   0
3   0   1   0
4   0   0   1
5   0   0   1
6   1   0   0
7   1   0   0

In [128]:
pd.get_dummies(df.department, drop_first=True)

   HR  IT
0   1   0
1   0   1
2   0   0
3   1   0
4   0   1
5   0   1
6   0   0
7   0   0

### Working With Time Data ###

In [1]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_csv("time_exercise.csv")
df.head()

   id_product  order_date  product_quantity  product_price  entry_date
0         401  2021-01-23               1.0     541.487603  2018-12-04
1         416  2020-04-02               1.0     131.181818  2018-12-04
2         717  2019-03-10               1.0    2035.488500  2018-12-04
3         778  2019-12-27               1.0     335.988000  2018-12-04
4         826  2020-02-19               1.0     342.292302  2018-12-04

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    object
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 35.7+ KB

In [12]:
pd.to_datetime(df.order_date)

0     2021-01-23
1     2020-04-02
2     2019-03-10
3     2019-12-27
4     2020-02-19
         ...
906   2020-11-24
907   2020-11-24
908   2020-11-22
909   2021-01-26
910   2020-12-06
Name: order_date, Length: 911, dtype: datetime64[ns]

In [13]:
df.entry_date = pd.to_datetime(df.entry_date)
df.order_date = pd.to_datetime(df.order_date)

In [15]:
df.dtypes

id_product                   int64
order_date          datetime64[ns]
product_quantity           float64
product_price              float64
entry_date          datetime64[ns]
dtype: object

In [16]:
df.entry_date.min()

Timestamp('2018-12-04 00:00:00')

In [18]:
df.entry_date.max()

Timestamp('2020-11-26 00:00:00')

In [20]:
df.order_date.min()

Timestamp('2018-11-14 00:00:00')

In [21]:
df.order_date.max()

Timestamp('2021-02-01 00:00:00')

In [22]:
df.entry_date.max() - df.entry_date.min()

Timedelta('723 days 00:00:00')

In [23]:
a = pd.Series(["15-03-2020", "18-05-2019", "24-07-2018"])
a

0    15-03-2020
1    18-05-2019
2    24-07-2018
dtype: object

In [25]:
a.max() # sonuç döndürdü ancak string içindeki ifadelerin ascci değerlerine göre

'24-07-2018'

In [27]:
pd.to_datetime(a, infer_datetime_format=True)

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]

In [28]:
pd.to_datetime(a, format="%d-%m-%Y")

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]

### Series.dt() ###

In [30]:
df.head(3)

   id_product order_date  product_quantity  product_price entry_date
0         401 2021-01-23               1.0     541.487603 2018-12-04
1         416 2020-04-02               1.0     131.181818 2018-12-04
2         717 2019-03-10               1.0    2035.488500 2018-12-04

In [32]:
df.entry_date.dt.date

0      2018-12-04
1      2018-12-04
2      2018-12-04
3      2018-12-04
4      2018-12-04
          ...
906    2020-10-07
907    2020-10-07
908    2020-11-13
909    2020-11-24
910    2020-11-26
Name: entry_date, Length: 911, dtype: object

In [33]:
df.entry_date.dt.year

0      2018
1      2018
2      2018
3      2018
4      2018
       ...
906    2020
907    2020
908    2020
909    2020
910    2020
Name: entry_date, Length: 911, dtype: int64

In [34]:
df.entry_date.dt.day

0       4
1       4
2       4
3       4
4       4
       ..
906     7
907     7
908    13
909    24
910    26
Name: entry_date, Length: 911, dtype: int64

In [36]:
df.entry_date.dt.day_name()

0        Tuesday
1        Tuesday
2        Tuesday
3        Tuesday
4        Tuesday
         ...
906    Wednesday
907    Wednesday
908       Friday
909      Tuesday
910     Thursday
Name: entry_date, Length: 911, dtype: object

In [37]:
df

     id_product order_date  product_quantity  product_price entry_date
0           401 2021-01-23               1.0     541.487603 2018-12-04
1           416 2020-04-02               1.0     131.181818 2018-12-04
2           717 2019-03-10               1.0    2035.488500 2018-12-04
3           778 2019-12-27               1.0     335.988000 2018-12-04
4           826 2020-02-19               1.0     342.292302 2018-12-04
..          ...        ...               ...            ...        ...
906     1536842 2020-11-24               1.0    1186.776860 2020-10-07
907     1536842 2020-11-24               1.0    1186.776860 2020-10-07
908     1536887 2020-11-22               1.0       0.000000 2020-11-13
909     1536952 2021-01-26               1.0     988.429752 2020-11-24
910     1536974 2020-12-06               1.0       0.000000 2020-11-26

[911 rows x 5 columns]

In [38]:
df["day_name"] = df.entry_date.dt.day_name()
df.day_name

0        Tuesday
1        Tuesday
2        Tuesday
3        Tuesday
4        Tuesday
         ...
906    Wednesday
907    Wednesday
908       Friday
909      Tuesday
910     Thursday
Name: day_name, Length: 911, dtype: object

In [39]:
df.head()

   id_product order_date  product_quantity  product_price entry_date day_name
0         401 2021-01-23               1.0     541.487603 2018-12-04  Tuesday
1         416 2020-04-02               1.0     131.181818 2018-12-04  Tuesday
2         717 2019-03-10               1.0    2035.488500 2018-12-04  Tuesday
3         778 2019-12-27               1.0     335.988000 2018-12-04  Tuesday
4         826 2020-02-19               1.0     342.292302 2018-12-04  Tuesday

In [42]:
del df.day_name

AttributeError: day_name

In [44]:
df.head()

   id_product order_date  product_quantity  product_price entry_date day_name
0         401 2021-01-23               1.0     541.487603 2018-12-04  Tuesday
1         416 2020-04-02               1.0     131.181818 2018-12-04  Tuesday
2         717 2019-03-10               1.0    2035.488500 2018-12-04  Tuesday
3         778 2019-12-27               1.0     335.988000 2018-12-04  Tuesday
4         826 2020-02-19               1.0     342.292302 2018-12-04  Tuesday

In [46]:
df.drop(labels="day_name", axis=1, inplace=True)

In [47]:
df.head()

   id_product order_date  product_quantity  product_price entry_date
0         401 2021-01-23               1.0     541.487603 2018-12-04
1         416 2020-04-02               1.0     131.181818 2018-12-04
2         717 2019-03-10               1.0    2035.488500 2018-12-04
3         778 2019-12-27               1.0     335.988000 2018-12-04
4         826 2020-02-19               1.0     342.292302 2018-12-04

### Datetime Module ###

In [49]:
from datetime import datetime

In [50]:
datetime.now()

datetime.datetime(2022, 5, 14, 20, 10, 42, 382035)

In [51]:
print(datetime.now())

2022-05-14 20:10:59.959094

In [53]:
print(datetime.today())

2022-05-14 20:11:14.919942

In [55]:
current_datetime = datetime.now()
print(current_datetime)

2022-05-14 20:11:46.766008

In [56]:
current_datetime.date()

datetime.date(2022, 5, 14)

In [57]:
current_datetime.weekday()

5

In [58]:
current_datetime.isoweekday()

6

In [61]:
pd.to_datetime("1993/05/03").isoweekday()

1

#### class datetime.timedelta ####

In [62]:
from datetime import timedelta

In [64]:
timedelta(days=2)

datetime.timedelta(days=2)

In [67]:
current_datetime

datetime.datetime(2022, 5, 14, 20, 11, 46, 766008)

In [68]:
two_days_before = current_datetime - timedelta(days=2)
two_days_before

datetime.datetime(2022, 5, 12, 20, 11, 46, 766008)

In [72]:
current_datetime + timedelta(weeks=2, days=3, hours=4, minutes=10)

datetime.datetime(2022, 6, 1, 0, 21, 46, 766008)

In [78]:
print(f"{'current_date': <15}", current_datetime)

current_date    2022-05-14 20:11:46.766008

In [80]:
print(current_datetime)

2022-05-14 20:11:46.766008

In [85]:
print(f"{'plus': <15}", timedelta(weeks=2, hours=4, minutes=10))

plus            14 days, 4:10:00

In [83]:
timedelta(weeks=2, hours=4, minutes=10)

datetime.timedelta(days=14, seconds=15000)

In [97]:
pd.to_datetime("08.10.1991")

Timestamp('1991-08-10 00:00:00')

In [99]:
pd.to_datetime("13/10/1942", infer_datetime_format=True)

Timestamp('1942-10-13 00:00:00')

In [106]:
datetime.now() - pd.to_datetime("08/10/1991")

Timedelta('11235 days 20:23:37.137152')

#### strftime() ####

In [107]:
current_datetime

datetime.datetime(2022, 5, 14, 20, 11, 46, 766008)

In [108]:
print(current_datetime)

2022-05-14 20:11:46.766008

In [109]:
current_datetime.year

2022

In [110]:
current_datetime.month

5

In [113]:
type(current_datetime)

datetime.datetime

In [112]:
type(current_datetime.year)

int

In [114]:
current_datetime.strftime("%Y")

'2022'

In [115]:
current_datetime.strftime("%d")

'14'

In [117]:
current_datetime.strftime("%m")

'05'

In [120]:
current_datetime.strftime("%Y")

'2022'

In [121]:
type(current_datetime.strftime("%Y"))

str

In [123]:
current_datetime.year

2022

In [124]:
type(current_datetime.year)

int

In [125]:
current_datetime.strftime("%d")

'14'

In [127]:
current_datetime.day

14

In [128]:
type(current_datetime.day)

int

In [129]:
type(current_datetime.strftime("%d"))

str

In [130]:
current_datetime.strftime("%m/%d/%Y")

'05/14/2022'

In [131]:
current_datetime.strftime("%m.%d.%Y")

'05.14.2022'

In [132]:
print(current_datetime)

2022-05-14 20:11:46.766008

In [134]:
current_datetime.strftime("%m/%d/%Y, %H")

'05/14/2022, 20'

In [135]:
current_datetime.strftime("%m/%d/%Y, %H:%M:%S")

'05/14/2022, 20:11:46'

### strptime() ###

In [140]:
from datetime import datetime

In [138]:
date_string = "21 June, 2018"
date_string

'21 June, 2018'

In [142]:
datetime.strptime(date_string, "%d %B, %Y")
# aynı işlemleri pd.to_datetime ile de yapabiliriz

datetime.datetime(2018, 6, 21, 0, 0)

In [147]:
pd.to_datetime(date_string).date()

datetime.date(2018, 6, 21)

In [148]:
print(pd.to_datetime(date_string).date())

2018-06-21

### Operation With Datetime Object ###

In [149]:
df.head()

   id_product order_date  product_quantity  product_price entry_date
0         401 2021-01-23               1.0     541.487603 2018-12-04
1         416 2020-04-02               1.0     131.181818 2018-12-04
2         717 2019-03-10               1.0    2035.488500 2018-12-04
3         778 2019-12-27               1.0     335.988000 2018-12-04
4         826 2020-02-19               1.0     342.292302 2018-12-04

In [150]:
df.dtypes

id_product                   int64
order_date          datetime64[ns]
product_quantity           float64
product_price              float64
entry_date          datetime64[ns]
dtype: object

In [152]:
df.order_date - df.entry_date

0     781 days
1     485 days
2      96 days
3     388 days
4     442 days
        ...
906    48 days
907    48 days
908     9 days
909    63 days
910    10 days
Length: 911, dtype: timedelta64[ns]

In [155]:
df["time_delta"] =df.order_date - df.entry_date
df.time_delta

0     781 days
1     485 days
2      96 days
3     388 days
4     442 days
        ...
906    48 days
907    48 days
908     9 days
909    63 days
910    10 days
Name: time_delta, Length: 911, dtype: timedelta64[ns]

In [156]:
df.head()

,id_product,order_date,product_quantity,product_price,entry_date,time_delta
0,401,2021-01-23,1.0,541.487603,2018-12-04,781 days
1,416,2020-04-02,1.0,131.181818,2018-12-04,485 days
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96 days
3,778,2019-12-27,1.0,335.988000,2018-12-04,388 days
4,826,2020-02-19,1.0,342.292302,2018-12-04,442 days

In [157]:
df.dtypes

id_product                    int64
order_date           datetime64[ns]
product_quantity            float64
product_price               float64
entry_date           datetime64[ns]
time_delta          timedelta64[ns]
dtype: object

In [159]:
df.time_delta.astype("str").str.split()

0      [781, days]
1      [485, days]
2       [96, days]
3      [388, days]
4      [442, days]
          ...
906     [48, days]
907     [48, days]
908      [9, days]
909     [63, days]
910     [10, days]
Name: time_delta, Length: 911, dtype: object

In [162]:
df.time_delta.astype("str").str.split().str[0].astype("int")

0      781
1      485
2       96
3      388
4      442
      ...
906     48
907     48
908      9
909     63
910     10
Name: time_delta, Length: 911, dtype: int32

In [163]:
df.time_delta = df.time_delta.astype("str").str.split().str[0].astype("int")

In [164]:
df.head()

,id_product,order_date,product_quantity,product_price,entry_date,time_delta
0,401,2021-01-23,1.0,541.487603,2018-12-04,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442

In [165]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    datetime64[ns]
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    datetime64[ns]
 5   time_delta        911 non-null    int32
dtypes: datetime64[ns](2), float64(2), int32(1), int64(1)
memory usage: 39.3 KB

In [171]:
df.columns

Index(['id_product', 'order_date', 'product_quantity', 'product_price',
       'entry_date', 'time_delta'],
      dtype='object')

In [174]:
df.groupby("id_product")["time_delta"].count()

id_product
401        1
416        1
717        1
778        1
826        1
          ..
1536841    3
1536842    2
1536887    1
1536952    1
1536974    1
Name: time_delta, Length: 498, dtype: int64

In [177]:
df.groupby("id_product")["time_delta"].min().sort_values()

id_product
1535922   -213
1535919   -211
1535914   -209
1535912   -170
1535957   -127
          ...
5655       781
401        781
12237      785
5094       787
4845       790
Name: time_delta, Length: 498, dtype: int32

In [ ]:
df.loc